projectebay/app/controllers/products/admins_controller.rb

INSERT INTO "product_blocks" ("product_id", "blocked_stock", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["blocked_stock", 3], ["created_at", "2018-04-30 10:47:40.098918"], ["updated_at", "2018-04-30 10:47:40.098918"]]
---
  def block
    block_product = ProductBlock.new(product_id:params[:product_id].to_i, blocked_stock:@product.stock)
    @product.update_attribute(:stock, 0)
    if block_product.save

SELECT  "product_blocks".* FROM "product_blocks" WHERE "product_blocks"."product_id" = ? ORDER BY "product_blocks"."id" ASC LIMIT ?  [["product_id", 1], ["LIMIT", 1]]
DELETE FROM "product_blocks" WHERE "product_blocks"."id" = ?  [["id", 1]]
---
  def unblock
    block_product = ProductBlock.where(product_id:params[:product_id].to_i).first
    if block_product
      @product.update_attribute(:stock, block_product.blocked_stock)
      render json: block_product.destroy, serializer: ProductBlockCompleteInfoSerializer, status: :ok

SELECT "product_blocks".* FROM "product_blocks"
---
  def index_block
    render json: {
      products_block: ActiveModel::Serializer::CollectionSerializer.new(ProductBlock.all, serializer: ProductBlockCompleteInfoSerializer)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_product
    @product = Product.find params[:product_id]