projectebay/app/controllers/comments_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_product
    @product = Product.find params[:product_id]