projectebay/app/controllers/pictures_controller.rb

INSERT INTO "pictures" ("name", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def profile
    trans = Transmission.new
    if trans.create_picture(params, @current_user)

INSERT INTO "pictures" ("name", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def product
    if is_my_product?
      if picture_does_not_have_purchases?(@product.cover)
        trans = Transmission.new
        trans.create_pictures(params, @product)

SELECT  1 AS one FROM "purchases" WHERE "purchases"."product_id" = ? LIMIT ?  [["product_id", 6], ["LIMIT", 1]]
SELECT "purchases".* FROM "purchases" WHERE "purchases"."product_id" = 6
UPDATE "products" SET "picture_id" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["picture_id", 9], ["updated_at", "2018-04-26 19:49:13.806054"], ["id", 6]]
---
  def set_picture_as_cover
    if is_my_product?
      if @product.purchases.empty?
        @product.update_attribute(:picture_id, @picture.id)

DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 2]]
DELETE FROM "product_pictures" WHERE "product_pictures"."id" = ?  [["id", 1]]
---
  def destroy
    if is_my_product?
      if @product.purchases.empty?
        @product_picture.destroy

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def set_picture
    @picture = Picture.find params[:id]

SELECT  "products".* FROM "products" WHERE "products"."picture_id" = ? ORDER BY "products"."id" ASC LIMIT ?  [["picture_id", 10], ["LIMIT", 1]]
---
  def set_product
    @product = Product.find params[:product_id]

SELECT  "product_pictures".* FROM "product_pictures" WHERE "product_pictures"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def set_product_picture
    @product_picture = ProductPicture.find params[:product_picture_id]