projectebay/app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    render_ok Product.all

INSERT INTO "products" ("name", "description", "category", "shipping_description", "origin_id", "user_id", "stock", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "pictures" ("name", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    product = Product.new({user:@current_user}.merge product_params)
    was_saved = product.save
    if was_saved
      trans = Transmission.new
      trans.create_pictures(params, product)

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 5]]
---
  def destroy
    if product_does_not_have_purchases?
      if product_not_blocked?
        if @product.user_id == @current_user.id
          render_ok @product.destroy

SELECT "users".* FROM "users" WHERE (email LIKE '%australia%' OR username LIKE '%australia%') ORDER BY created_at DESC
SELECT "products".* FROM "products" WHERE (name LIKE '%antiques%' OR category LIKE '%0%' OR shipping_description LIKE '%antiques%' OR price LIKE '%antiques%' OR description LIKE '%antiques%') AND (price BETWEEN '0' AND '12') ORDER BY created_at DESC
---
  def search
    users = nil
    products = nil
    products_price_range = nil
    if !params[:input].nil?
      params[:input] = params[:input].downcase if params[:input].is_a?(String)
      users = User.search(params[:input])
      products = if params[:input].is_a?(String) then
          Product.search(params[:input])

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def set_product
    @product = Product.find params[:id]