projectebay/app/controllers/purchases_controller.rb

UPDATE "purchases" SET "was_delivered" = ?, "updated_at" = ? WHERE "purchases"."id" = ?  [["was_delivered", "t"], ["updated_at", "2018-04-28 03:25:09.396389"], ["id", 1]]
---
  def set_buyer_score
    if is_my_sale?
      if valid_score? params[:buyer_score]
        if was_delivered?
          if buyer_scored?
            @purchase.update_attribute(:buyer_score, params[:buyer_score])

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "products" SET "stock" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["stock", 29], ["updated_at", "2018-04-27 04:16:58.830093"], ["id", 2]]
INSERT INTO "purchases" ("seller_id", "buyer_id", "origin_id", "product_id", "total_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["seller_id", 2], ["buyer_id", 1], ["origin_id", 2], ["product_id", 2], ["total_price", 200.0], ["created_at", "2018-04-27 04:16:58.935410"], ["updated_at", "2018-04-27 04:16:58.935410"]]
---
  def create
    errors = {}
    result = []
    params.each do |key, options|
      if key.include?("product")
        options = JSON.parse(options)
        @product = Product.find options["product_id"]
          if is_the_destiny_mine?(options)
            if @product.stock >= options["quantity"]
              purchase = Purchase.new(buyer_id:@current_user.id, seller_id:@product.user.id, product_id:@product.id, quantity:options["quantity"], total_price:(@product.price*options["quantity"]), destiny:@origin)
              @product.update_attribute(:stock, @product.stock - options["quantity"])
              if purchase.save and @product.save

SELECT  "purchases".* FROM "purchases" WHERE "purchases"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_purchase
    @purchase = Purchase.find params[:id]

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_product
    @product = Product.find params[:product_id]