projectebay/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    render_ok User.all

INSERT INTO "users" ("name", "username", "password_digest", "email", "birthdate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "pictures" ("name", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    user = User.new user_params
    was_saved = user.save
    if was_saved
      trans = Transmission.new
      if trans.create_picture(params, user) or trans.empty_params

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_user
    @user = User.find params[:id]